---
kind: method
id: M:Autodesk.Revit.DB.FabricationConfiguration.GetAllPartStatuses
source: html/0cd93d49-9295-cd01-dd68-3a7abe616690.htm
---
# Autodesk.Revit.DB.FabricationConfiguration.GetAllPartStatuses Method

Gets all possible fabrication part status identifiers.

## Syntax (C#)
```csharp
public IList<int> GetAllPartStatuses()
```

## Returns
An array of status identifiers.